ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/wdt_a.xml
<module id="WDT_A" HW_revision=""><register id="CTL" width="16" offset="0xC" internal="0" description="Watchdog Timer Control Register"><bitfield id="IS" description="Watchdog timer interval select" begin="2" end="0" width="3" rwaccess="R/W"><bitenum id="IS__0" value="0" description="Watchdog clock source / (2^(31)) (18:12:16 at 32.768 kHz)"/><bitenum id="IS__1" value="1" description="Watchdog clock source /(2^(27)) (01:08:16 at 32.768 kHz)"/><bitenum id="IS__2" value="2" description="Watchdog clock source /(2^(23)) (00:04:16 at 32.768 kHz)"/><bitenum id="IS__3" value="3" description="Watchdog clock source /(2^(19)) (00:00:16 at 32.768 kHz)"/><bitenum id="IS__4" value="4" description="Watchdog clock source /(2^(15)) (1 s at 32.768 kHz)"/><bitenum id="IS__5" value="5" description="Watchdog clock source / (2^(13)) (250 ms at 32.768 kHz)"/><bitenum id="IS__6" value="6" description="Watchdog clock source / (2^(9)) (15.625 ms at 32.768 kHz)"/><bitenum id="IS__7" value="7" description="Watchdog clock source / (2^(6)) (1.95 ms at 32.768 kHz)"/></bitfield><bitfield id="CNTCL" description="Watchdog timer counter clear" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="CNTCL__0" value="0" description="No action"/><bitenum id="CNTCL__1" value="1" description="WDTCNT = 0000h"/></bitfield><bitfield id="TMSEL" description="Watchdog timer mode select." begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="TMSEL__0" value="0" description="Watchdog mode"/><bitenum id="TMSEL__1" value="1" description="Interval timer mode"/></bitfield><bitfield id="SSEL" description="Watchdog timer clock source select." begin="6" end="5" width="2" rwaccess="R/W"><bitenum id="SSEL__0" value="0" description="SMCLK"/><bitenum id="SSEL__1" value="1" description="ACLK"/><bitenum id="SSEL__2" value="2" description="VLOCLK"/><bitenum id="SSEL__3" value="3" description="BCLK"/></bitfield><bitfield id="HOLD" description="Watchdog timer hold" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="HOLD__0" value="0" description="Watchdog timer is not stopped"/><bitenum id="HOLD__1" value="1" description="Watchdog timer is stopped"/></bitfield><bitfield id="PW" description="Watchdog timer password" begin="15" end="8" width="8" rwaccess="R/W"/></register></module>